abhijithpecsol/ncsu-ece561-EmbeddedSystemsDesign/examples/TSSEVB_DEMO/build/cw10/TSSEVB_DEMO/Project_Headers/mc9s08lg32.h
/* Based on CPU DB MC9S08LG32_80, version 3.00.006 (RegistersPrg V2.32) */
/*
** ###################################################################
**     Filename  : mc9s08lg32.h
**     Processor : MC9S08LG32CLK
**     FileFormat: V2.32
**     DataSheet : MC9S08LG32RM Rev. 4 2/2009
**     Compiler  : CodeWarrior compiler
**     Date/Time : 5.10.2010, 13:53
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2010 Freescale Semiconductor, Inc. All Rights Reserved.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**      - 20.1.2009, V3.00.0:
**              - Updated definition of the PINPS1 register: PINPS1[KBI1:8] -> PINPS1[KBI0:7].
**              -   REASON: Changes in the RM(from Rev. 0 Draft B to Rev.3 11/2008).
**      - 12.3.2009, V3.00.1:
**              - Removed register LCDRVC. Removed bits LCDSUPPLY[BBYPASS,HREFSEL].
**              - Added registers NVFTRIM(0xFFAE), NVICSTRM(0xFFAF).
**              -   REASON: Changes in the RM(from Rev.3 11/2008 to Rev. 4 2/2009).
**
**     File-Format-Revisions:
**      - 28.11.2008, V2.25 :
**               - StandBy RAM array declaration for ANSI-C added
**      - 1.12.2008, V2.26 :
**               - Duplication of bit (or bit-group) name with register name is not marked as a problem, if register is internal only and it is not displayed in I/O map.
**      - 17.3.2009, V2.27 :
**               - Merged bit-group is not generated, if the name matches with another bit name in the register
**      - 6.4.2009, V2.28 :
**               - Fixed generation of merged bits for bit-groups with a digit at the end, if group-name is defined in CPUDB
**      - 3.8.2009, V2.29 :
**               - If there is just one bits group matching register name, single bits are not generated
**      - 10.9.2009, V2.30 :
**               - Fixed generation of registers arrays.
**      - 15.10.2009, V2.31 :
**               - HCS08 family: Bits and bit-groups are published for 16-bit registers: 8-bit overlay registers are required.
**      - 18.05.2010, V2.32 :
**               - MISRA compliance: U/UL suffixes added to all numbers (_MASK,_BITNUM and addresses)
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S08LG32_H
#define _MC9S08LG32_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

/* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() {asm sta SRS;}
#endif
#endif /* __RESET_WATCHDOG */

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */

/**************** interrupt vector numbers ****************/
#define VectorNumber_Vrtc               26U
#define VectorNumber_Vmtim              25U
#define VectorNumber_Vtpm2ovf           24U
#define VectorNumber_Vtpm2ch5           23U
#define VectorNumber_Vtpm2ch4           22U
#define VectorNumber_Vtpm2ch3           21U
#define VectorNumber_Vtpm2ch2           20U
#define VectorNumber_Vtpm2ch1           19U
#define VectorNumber_Vtpm2ch0           18U
#define VectorNumber_Vadc               17U
#define VectorNumber_Vkeyboard          16U
#define VectorNumber_Viic               15U
#define VectorNumber_Vsci2tx            14U
#define VectorNumber_Vsci2rx            13U
#define VectorNumber_Vsci2err           12U
#define VectorNumber_Vspi               11U
#define VectorNumber_Vlcd               10U
#define VectorNumber_Vsci1tx            9U
#define VectorNumber_Vsci1rx            8U
#define VectorNumber_Vsci1err           7U
#define VectorNumber_Vtpm1ovf           6U
#define VectorNumber_Vtpm1ch1           5U
#define VectorNumber_Vtpm1ch0           4U
#define VectorNumber_Vlvw               3U
#define VectorNumber_Virq               2U
#define VectorNumber_Vswi               1U
#define VectorNumber_Vreset             0U

/**************** interrupt vector table ****************/
#define Vrtc                            0xFFCAU
#define Vmtim                           0xFFCCU
#define Vtpm2ovf                        0xFFCEU
#define Vtpm2ch5                        0xFFD0U
#define Vtpm2ch4                        0xFFD2U
#define Vtpm2ch3                        0xFFD4U
#define Vtpm2ch2                        0xFFD6U
#define Vtpm2ch1                        0xFFD8U
#define Vtpm2ch0                        0xFFDAU
#define Vadc                            0xFFDCU
#define Vkeyboard                       0xFFDEU
#define Viic                            0xFFE0U
#define Vsci2tx                         0xFFE2U
#define Vsci2rx                         0xFFE4U
#define Vsci2err                        0xFFE6U
#define Vspi                            0xFFE8U
#define Vlcd                            0xFFEAU
#define Vsci1tx                         0xFFECU
#define Vsci1rx                         0xFFEEU
#define Vsci1err                        0xFFF0U
#define Vtpm1ovf                        0xFFF2U
#define Vtpm1ch1                        0xFFF4U
#define Vtpm1ch0                        0xFFF6U
#define Vlvw                            0xFFF8U
#define Virq                            0xFFFAU
#define Vswi                            0xFFFCU
#define Vreset                          0xFFFEU

/**************** registers I/O map ****************/

/*** PTAD - Port A Data Register; 0x00000000 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD0       :1;                                       /* Port A Data Register Bit 0 */
    byte PTAD1       :1;                                       /* Port A Data Register Bit 1 */
    byte PTAD2       :1;                                       /* Port A Data Register Bit 2 */
    byte PTAD3       :1;                                       /* Port A Data Register Bit 3 */
    byte PTAD4       :1;                                       /* Port A Data Register Bit 4 */
    byte PTAD5       :1;                                       /* Port A Data Register Bit 5 */
    byte PTAD6       :1;                                       /* Port A Data Register Bit 6 */
    byte PTAD7       :1;                                       /* Port A Data Register Bit 7 */
  } Bits;
} PTADSTR;
extern volatile PTADSTR _PTAD @0x00000000;
#define PTAD                            _PTAD.Byte
#define PTAD_PTAD0                      _PTAD.Bits.PTAD0
#define PTAD_PTAD1                      _PTAD.Bits.PTAD1
#define PTAD_PTAD2                      _PTAD.Bits.PTAD2
#define PTAD_PTAD3                      _PTAD.Bits.PTAD3
#define PTAD_PTAD4                      _PTAD.Bits.PTAD4
#define PTAD_PTAD5                      _PTAD.Bits.PTAD5
#define PTAD_PTAD6                      _PTAD.Bits.PTAD6
#define PTAD_PTAD7                      _PTAD.Bits.PTAD7

#define PTAD_PTAD0_MASK                 1U
#define PTAD_PTAD1_MASK                 2U
#define PTAD_PTAD2_MASK                 4U
#define PTAD_PTAD3_MASK                 8U
#define PTAD_PTAD4_MASK                 16U
#define PTAD_PTAD5_MASK                 32U
#define PTAD_PTAD6_MASK                 64U
#define PTAD_PTAD7_MASK                 128U


