abhijithpecsol/ncsu-ece561-EmbeddedSystemsDesign/examples/TSSEVB_DEMO/build/cw10/TSSEVB_DEMO/Project_Headers/mc9s08lg32.h
#define LCDWF43_BPALCD43_MASK           1U
#define LCDWF43_BPBLCD43_MASK           2U
#define LCDWF43_BPCLCD43_MASK           4U
#define LCDWF43_BPDLCD43_MASK           8U
#define LCDWF43_BPELCD43_MASK           16U
#define LCDWF43_BPFLCD43_MASK           32U
#define LCDWF43_BPGLCD43_MASK           64U
#define LCDWF43_BPHLCD43_MASK           128U


/*** LCDWF44 - LCD Waveform Register 44; 0x0000085C ***/
typedef union {
  byte Byte;
  struct {
    byte BPALCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
    byte BPBLCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
    byte BPCLCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
    byte BPDLCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
    byte BPELCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
    byte BPFLCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
    byte BPGLCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
    byte BPHLCD44    :1;                                       /* Segment on/off Frontplane/Backplane Operation */
  } Bits;
} LCDWF44STR;
extern volatile LCDWF44STR _LCDWF44 @0x0000085C;
#define LCDWF44                         _LCDWF44.Byte
#define LCDWF44_BPALCD44                _LCDWF44.Bits.BPALCD44
#define LCDWF44_BPBLCD44                _LCDWF44.Bits.BPBLCD44
#define LCDWF44_BPCLCD44                _LCDWF44.Bits.BPCLCD44
#define LCDWF44_BPDLCD44                _LCDWF44.Bits.BPDLCD44
#define LCDWF44_BPELCD44                _LCDWF44.Bits.BPELCD44
#define LCDWF44_BPFLCD44                _LCDWF44.Bits.BPFLCD44
#define LCDWF44_BPGLCD44                _LCDWF44.Bits.BPGLCD44
#define LCDWF44_BPHLCD44                _LCDWF44.Bits.BPHLCD44

#define LCDWF44_BPALCD44_MASK           1U
#define LCDWF44_BPBLCD44_MASK           2U
#define LCDWF44_BPCLCD44_MASK           4U
#define LCDWF44_BPDLCD44_MASK           8U
#define LCDWF44_BPELCD44_MASK           16U
#define LCDWF44_BPFLCD44_MASK           32U
#define LCDWF44_BPGLCD44_MASK           64U
#define LCDWF44_BPHLCD44_MASK           128U


/*** SRS - System Reset Status Register; 0x00001800 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte LVD         :1;                                       /* Low Voltage Detect */
    byte             :1; 
    byte ILAD        :1;                                       /* Illegal Address */
    byte ILOP        :1;                                       /* Illegal Opcode */
    byte COP         :1;                                       /* Computer Operating Properly (COP) Watchdog */
    byte PIN         :1;                                       /* External Reset Pin */
    byte POR         :1;                                       /* Power-On Reset */
  } Bits;
} SRSSTR;
extern volatile SRSSTR _SRS @0x00001800;
#define SRS                             _SRS.Byte
#define SRS_LVD                         _SRS.Bits.LVD
#define SRS_ILAD                        _SRS.Bits.ILAD
#define SRS_ILOP                        _SRS.Bits.ILOP
#define SRS_COP                         _SRS.Bits.COP
#define SRS_PIN                         _SRS.Bits.PIN
#define SRS_POR                         _SRS.Bits.POR

#define SRS_LVD_MASK                    2U
#define SRS_ILAD_MASK                   8U
#define SRS_ILOP_MASK                   16U
#define SRS_COP_MASK                    32U
#define SRS_PIN_MASK                    64U
#define SRS_POR_MASK                    128U


/*** SBDFR - System Background Debug Force Reset Register; 0x00001801 ***/
typedef union {
  byte Byte;
  struct {
    byte BDFR        :1;                                       /* Background Debug Force Reset */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} SBDFRSTR;
extern volatile SBDFRSTR _SBDFR @0x00001801;
#define SBDFR                           _SBDFR.Byte
#define SBDFR_BDFR                      _SBDFR.Bits.BDFR

#define SBDFR_BDFR_MASK                 1U


/*** SOPT1 - System Options Register 1; 0x00001802 ***/
typedef union {
  byte Byte;
  struct {
    byte RSTPE       :1;                                       /* RESET Pin Enable */
    byte BKGDPE      :1;                                       /* Background Debug Mode Pin Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte STOPE       :1;                                       /* Stop Mode Enable */
    byte COPT        :1;                                       /* COP Watchdog Timeout */
    byte COPE        :1;                                       /* COP Watchdog Enable */
  } Bits;
} SOPT1STR;
extern volatile SOPT1STR _SOPT1 @0x00001802;
#define SOPT1                           _SOPT1.Byte
#define SOPT1_RSTPE                     _SOPT1.Bits.RSTPE
#define SOPT1_BKGDPE                    _SOPT1.Bits.BKGDPE
#define SOPT1_STOPE                     _SOPT1.Bits.STOPE
#define SOPT1_COPT                      _SOPT1.Bits.COPT
#define SOPT1_COPE                      _SOPT1.Bits.COPE

#define SOPT1_RSTPE_MASK                1U
#define SOPT1_BKGDPE_MASK               2U
#define SOPT1_STOPE_MASK                32U
#define SOPT1_COPT_MASK                 64U
#define SOPT1_COPE_MASK                 128U


/*** SOPT2 - System Options Register 2; 0x00001803 ***/
typedef union {
  byte Byte;
  struct {
    byte SPIFE       :1;                                       /* SPI Filter Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte COPCLKS     :1;                                       /* COP Watchdog Clock Select */
  } Bits;
} SOPT2STR;
extern volatile SOPT2STR _SOPT2 @0x00001803;
#define SOPT2                           _SOPT2.Byte
#define SOPT2_SPIFE                     _SOPT2.Bits.SPIFE
#define SOPT2_COPCLKS                   _SOPT2.Bits.COPCLKS

#define SOPT2_SPIFE_MASK                1U
#define SOPT2_COPCLKS_MASK              128U


