abhijithpecsol/ncsu-ece561-EmbeddedSystemsDesign/examples/TSSEVB_DEMO/build/cw10/TSSEVB_DEMO/Project_Headers/mc9s08lg32.h
/*** FCMD - FLASH Command Register; 0x00001826 ***/
typedef union {
  byte Byte;
  struct {
    byte FCMD0       :1;                                       /* FLASH Command Bit 0 */
    byte FCMD1       :1;                                       /* FLASH Command Bit 1 */
    byte FCMD2       :1;                                       /* FLASH Command Bit 2 */
    byte FCMD3       :1;                                       /* FLASH Command Bit 3 */
    byte FCMD4       :1;                                       /* FLASH Command Bit 4 */
    byte FCMD5       :1;                                       /* FLASH Command Bit 5 */
    byte FCMD6       :1;                                       /* FLASH Command Bit 6 */
    byte FCMD7       :1;                                       /* FLASH Command Bit 7 */
  } Bits;
} FCMDSTR;
extern volatile FCMDSTR _FCMD @0x00001826;
#define FCMD                            _FCMD.Byte
#define FCMD_FCMD0                      _FCMD.Bits.FCMD0
#define FCMD_FCMD1                      _FCMD.Bits.FCMD1
#define FCMD_FCMD2                      _FCMD.Bits.FCMD2
#define FCMD_FCMD3                      _FCMD.Bits.FCMD3
#define FCMD_FCMD4                      _FCMD.Bits.FCMD4
#define FCMD_FCMD5                      _FCMD.Bits.FCMD5
#define FCMD_FCMD6                      _FCMD.Bits.FCMD6
#define FCMD_FCMD7                      _FCMD.Bits.FCMD7

#define FCMD_FCMD0_MASK                 1U
#define FCMD_FCMD1_MASK                 2U
#define FCMD_FCMD2_MASK                 4U
#define FCMD_FCMD3_MASK                 8U
#define FCMD_FCMD4_MASK                 16U
#define FCMD_FCMD5_MASK                 32U
#define FCMD_FCMD6_MASK                 64U
#define FCMD_FCMD7_MASK                 128U


/*** PINPS1 - Pin Position Control Register 1; 0x00001830 ***/
typedef union {
  byte Byte;
  struct {
    byte KBI0        :1;                                       /* KBI0 Pin Position */
    byte KBI1        :1;                                       /* KBI1 Pin Position */
    byte KBI2        :1;                                       /* KBI2 Pin Position */
    byte KBI3        :1;                                       /* KBI3 Pin Position */
    byte KBI4        :1;                                       /* KBI4 Pin Position */
    byte KBI5        :1;                                       /* KBI5 Pin Position */
    byte KBI6        :1;                                       /* KBI6 Pin Position */
    byte KBI7        :1;                                       /* KBI7 Pin Position */
  } Bits;
} PINPS1STR;
extern volatile PINPS1STR _PINPS1 @0x00001830;
#define PINPS1                          _PINPS1.Byte
#define PINPS1_KBI0                     _PINPS1.Bits.KBI0
#define PINPS1_KBI1                     _PINPS1.Bits.KBI1
#define PINPS1_KBI2                     _PINPS1.Bits.KBI2
#define PINPS1_KBI3                     _PINPS1.Bits.KBI3
#define PINPS1_KBI4                     _PINPS1.Bits.KBI4
#define PINPS1_KBI5                     _PINPS1.Bits.KBI5
#define PINPS1_KBI6                     _PINPS1.Bits.KBI6
#define PINPS1_KBI7                     _PINPS1.Bits.KBI7

#define PINPS1_KBI0_MASK                1U
#define PINPS1_KBI1_MASK                2U
#define PINPS1_KBI2_MASK                4U
#define PINPS1_KBI3_MASK                8U
#define PINPS1_KBI4_MASK                16U
#define PINPS1_KBI5_MASK                32U
#define PINPS1_KBI6_MASK                64U
#define PINPS1_KBI7_MASK                128U


/*** PINPS2 - Pin Position Control Register 2; 0x00001831 ***/
typedef union {
  byte Byte;
  struct {
    byte TPM10       :1;                                       /* TPM1[0] Pin Position */
    byte TPM11       :1;                                       /* TPM1[1] Pin Position */
    byte TPM20       :1;                                       /* TPM2[0] Pin Position */
    byte TPM21       :1;                                       /* TPM2[1] Pin Position */
    byte TPM22       :1;                                       /* TPM2[2] Pin Position */
    byte TPM23       :1;                                       /* TPM2[3] Pin Position */
    byte TPM24       :1;                                       /* TPM2[4] Pin Position */
    byte TPM25       :1;                                       /* TPM2[5] Pin Position */
  } Bits;
  struct {
    byte grpTPM_10 :2;
    byte grpTPM_20 :6;
  } MergedBits;
} PINPS2STR;
extern volatile PINPS2STR _PINPS2 @0x00001831;
#define PINPS2                          _PINPS2.Byte
#define PINPS2_TPM10                    _PINPS2.Bits.TPM10
#define PINPS2_TPM11                    _PINPS2.Bits.TPM11
#define PINPS2_TPM20                    _PINPS2.Bits.TPM20
#define PINPS2_TPM21                    _PINPS2.Bits.TPM21
#define PINPS2_TPM22                    _PINPS2.Bits.TPM22
#define PINPS2_TPM23                    _PINPS2.Bits.TPM23
#define PINPS2_TPM24                    _PINPS2.Bits.TPM24
#define PINPS2_TPM25                    _PINPS2.Bits.TPM25
#define PINPS2_TPM_10                   _PINPS2.MergedBits.grpTPM_10
#define PINPS2_TPM_20                   _PINPS2.MergedBits.grpTPM_20
#define PINPS2_TPM                      PINPS2_TPM_10

#define PINPS2_TPM10_MASK               1U
#define PINPS2_TPM11_MASK               2U
#define PINPS2_TPM20_MASK               4U
#define PINPS2_TPM21_MASK               8U
#define PINPS2_TPM22_MASK               16U
#define PINPS2_TPM23_MASK               32U
#define PINPS2_TPM24_MASK               64U
#define PINPS2_TPM25_MASK               128U
#define PINPS2_TPM_10_MASK              3U
#define PINPS2_TPM_10_BITNUM            0U
#define PINPS2_TPM_20_MASK              252U
#define PINPS2_TPM_20_BITNUM            2U


/*** PINPS3 - Pin Position Control Register 3; 0x00001832 ***/
typedef union {
  byte Byte;
  struct {
    byte SS          :1;                                       /* SS Pin Position */
    byte SCK         :1;                                       /* SCK Pin Position */
    byte MOSI        :1;                                       /* MOSI Pin Position */
    byte MISO        :1;                                       /* MISO Pin Position */
    byte SDA         :1;                                       /* SDA Pin Position */
    byte SCL         :1;                                       /* SCL Pin Position */
    byte RX2         :1;                                       /* RX2 Pin Position */
    byte TX2         :1;                                       /* TX2 Pin Position */
  } Bits;
} PINPS3STR;
extern volatile PINPS3STR _PINPS3 @0x00001832;
#define PINPS3                          _PINPS3.Byte
#define PINPS3_SS                       _PINPS3.Bits.SS
#define PINPS3_SCK                      _PINPS3.Bits.SCK
#define PINPS3_MOSI                     _PINPS3.Bits.MOSI
#define PINPS3_MISO                     _PINPS3.Bits.MISO
#define PINPS3_SDA                      _PINPS3.Bits.SDA
#define PINPS3_SCL                      _PINPS3.Bits.SCL
#define PINPS3_RX2                      _PINPS3.Bits.RX2
#define PINPS3_TX2                      _PINPS3.Bits.TX2

