abhijithpecsol/ncsu-ece561-EmbeddedSystemsDesign/examples/TSSEVB_DEMO/build/cw10/TSSEVB_DEMO/Project_Headers/mc9s08lg32.h
#define PTHDS_PTHDS0_MASK               1U
#define PTHDS_PTHDS1_MASK               2U
#define PTHDS_PTHDS2_MASK               4U
#define PTHDS_PTHDS3_MASK               8U
#define PTHDS_PTHDS4_MASK               16U
#define PTHDS_PTHDS5_MASK               32U
#define PTHDS_PTHDS6_MASK               64U
#define PTHDS_PTHDS7_MASK               128U


/*** MTIMSC - MTIM Clock Configuration Register; 0x00001870 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TSTP        :1;                                       /* MTIM Counter Stop */
    byte TRST        :1;                                       /* MTIM Counter Reset */
    byte TOIE        :1;                                       /* MTIM Overflow Interrupt Enable */
    byte TOF         :1;                                       /* MTIM Overflow Flag */
  } Bits;
} MTIMSCSTR;
extern volatile MTIMSCSTR _MTIMSC @0x00001870;
#define MTIMSC                          _MTIMSC.Byte
#define MTIMSC_TSTP                     _MTIMSC.Bits.TSTP
#define MTIMSC_TRST                     _MTIMSC.Bits.TRST
#define MTIMSC_TOIE                     _MTIMSC.Bits.TOIE
#define MTIMSC_TOF                      _MTIMSC.Bits.TOF

#define MTIMSC_TSTP_MASK                16U
#define MTIMSC_TRST_MASK                32U
#define MTIMSC_TOIE_MASK                64U
#define MTIMSC_TOF_MASK                 128U


/*** MTIMCLK - MTIM Clock Configuration Register; 0x00001871 ***/
typedef union {
  byte Byte;
  struct {
    byte PS0         :1;                                       /* Clock source Prescaler Bit 0 */
    byte PS1         :1;                                       /* Clock source Prescaler Bit 1 */
    byte PS2         :1;                                       /* Clock source Prescaler Bit 2 */
    byte PS3         :1;                                       /* Clock source Prescaler Bit 3 */
    byte CLKS0       :1;                                       /* Clock source Select Bit 0 */
    byte CLKS1       :1;                                       /* Clock source Select Bit 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPS   :4;
    byte grpCLKS :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} MTIMCLKSTR;
extern volatile MTIMCLKSTR _MTIMCLK @0x00001871;
#define MTIMCLK                         _MTIMCLK.Byte
#define MTIMCLK_PS0                     _MTIMCLK.Bits.PS0
#define MTIMCLK_PS1                     _MTIMCLK.Bits.PS1
#define MTIMCLK_PS2                     _MTIMCLK.Bits.PS2
#define MTIMCLK_PS3                     _MTIMCLK.Bits.PS3
#define MTIMCLK_CLKS0                   _MTIMCLK.Bits.CLKS0
#define MTIMCLK_CLKS1                   _MTIMCLK.Bits.CLKS1
#define MTIMCLK_PS                      _MTIMCLK.MergedBits.grpPS
#define MTIMCLK_CLKS                    _MTIMCLK.MergedBits.grpCLKS

#define MTIMCLK_PS0_MASK                1U
#define MTIMCLK_PS1_MASK                2U
#define MTIMCLK_PS2_MASK                4U
#define MTIMCLK_PS3_MASK                8U
#define MTIMCLK_CLKS0_MASK              16U
#define MTIMCLK_CLKS1_MASK              32U
#define MTIMCLK_PS_MASK                 15U
#define MTIMCLK_PS_BITNUM               0U
#define MTIMCLK_CLKS_MASK               48U
#define MTIMCLK_CLKS_BITNUM             4U


/*** MTIMCNT - MTIM Counter Register; 0x00001872 ***/
typedef union {
  byte Byte;
} MTIMCNTSTR;
extern volatile MTIMCNTSTR _MTIMCNT @0x00001872;
#define MTIMCNT                         _MTIMCNT.Byte


/*** MTIMMOD - MTIM Modulo Register; 0x00001873 ***/
typedef union {
  byte Byte;
} MTIMMODSTR;
extern volatile MTIMMODSTR _MTIMMOD @0x00001873;
#define MTIMMOD                         _MTIMMOD.Byte


/*** PTIPE - Port I Pull Enable Register; 0x00001874 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIPE0      :1;                                       /* Internal Pull Enable for Port I Bit 0 */
    byte PTIPE1      :1;                                       /* Internal Pull Enable for Port I Bit 1 */
    byte PTIPE2      :1;                                       /* Internal Pull Enable for Port I Bit 2 */
    byte PTIPE3      :1;                                       /* Internal Pull Enable for Port I Bit 3 */
    byte PTIPE4      :1;                                       /* Internal Pull Enable for Port I Bit 4 */
    byte PTIPE5      :1;                                       /* Internal Pull Enable for Port I Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTIPE :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTIPESTR;
extern volatile PTIPESTR _PTIPE @0x00001874;
#define PTIPE                           _PTIPE.Byte
#define PTIPE_PTIPE0                    _PTIPE.Bits.PTIPE0
#define PTIPE_PTIPE1                    _PTIPE.Bits.PTIPE1
#define PTIPE_PTIPE2                    _PTIPE.Bits.PTIPE2
#define PTIPE_PTIPE3                    _PTIPE.Bits.PTIPE3
#define PTIPE_PTIPE4                    _PTIPE.Bits.PTIPE4
#define PTIPE_PTIPE5                    _PTIPE.Bits.PTIPE5
#define PTIPE_PTIPE                     _PTIPE.MergedBits.grpPTIPE

#define PTIPE_PTIPE0_MASK               1U
#define PTIPE_PTIPE1_MASK               2U
#define PTIPE_PTIPE2_MASK               4U
#define PTIPE_PTIPE3_MASK               8U
#define PTIPE_PTIPE4_MASK               16U
#define PTIPE_PTIPE5_MASK               32U
#define PTIPE_PTIPE_MASK                63U
#define PTIPE_PTIPE_BITNUM              0U


/*** PTISE - Port I Slew Rate Enable Register; 0x00001875 ***/
typedef union {
  byte Byte;
  struct {
    byte PTISE0      :1;                                       /* Output Slew Rate Enable for Port I Bit 0 */
    byte PTISE1      :1;                                       /* Output Slew Rate Enable for Port I Bit 1 */
    byte PTISE2      :1;                                       /* Output Slew Rate Enable for Port I Bit 2 */
    byte PTISE3      :1;                                       /* Output Slew Rate Enable for Port I Bit 3 */
    byte PTISE4      :1;                                       /* Output Slew Rate Enable for Port I Bit 4 */
    byte PTISE5      :1;                                       /* Output Slew Rate Enable for Port I Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTISE :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTISESTR;
extern volatile PTISESTR _PTISE @0x00001875;
#define PTISE                           _PTISE.Byte
#define PTISE_PTISE0                    _PTISE.Bits.PTISE0
#define PTISE_PTISE1                    _PTISE.Bits.PTISE1
#define PTISE_PTISE2                    _PTISE.Bits.PTISE2
#define PTISE_PTISE3                    _PTISE.Bits.PTISE3
#define PTISE_PTISE4                    _PTISE.Bits.PTISE4
#define PTISE_PTISE5                    _PTISE.Bits.PTISE5
#define PTISE_PTISE                     _PTISE.MergedBits.grpPTISE

#define PTISE_PTISE0_MASK               1U
#define PTISE_PTISE1_MASK               2U
#define PTISE_PTISE2_MASK               4U
#define PTISE_PTISE3_MASK               8U
#define PTISE_PTISE4_MASK               16U
#define PTISE_PTISE5_MASK               32U
#define PTISE_PTISE_MASK                63U
#define PTISE_PTISE_BITNUM              0U


/*** PTIDS - Port I Drive Strength Selection Register; 0x00001876 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIDS0      :1;                                       /* Output Drive Strength Selection for Port I Bit 0 */
    byte PTIDS1      :1;                                       /* Output Drive Strength Selection for Port I Bit 1 */
    byte PTIDS2      :1;                                       /* Output Drive Strength Selection for Port I Bit 2 */
    byte PTIDS3      :1;                                       /* Output Drive Strength Selection for Port I Bit 3 */
    byte PTIDS4      :1;                                       /* Output Drive Strength Selection for Port I Bit 4 */
    byte PTIDS5      :1;                                       /* Output Drive Strength Selection for Port I Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTIDS :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTIDSSTR;
