abhijithpecsol/ncsu-ece561-EmbeddedSystemsDesign/examples/TSSEVB_DEMO/build/cw10/TSSEVB_DEMO/Project_Headers/mc9s08lg32.h
/*** NVOPT - Nonvolatile Flash Options Register; 0x0000FFBF ***/
typedef union {
  byte Byte;
  struct {
    byte SEC00       :1;                                       /* Security State Code, bit 0 */
    byte SEC01       :1;                                       /* Security State Code, bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Mechanism Enable */
  } Bits;
  struct {
    byte grpSEC0 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} NVOPTSTR;
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */
#define _NVOPT (*(const NVOPTSTR * __far)0x0000FFBF)
#define NVOPT                           _NVOPT.Byte
#define NVOPT_SEC00                     _NVOPT.Bits.SEC00
#define NVOPT_SEC01                     _NVOPT.Bits.SEC01
#define NVOPT_FNORED                    _NVOPT.Bits.FNORED
#define NVOPT_KEYEN                     _NVOPT.Bits.KEYEN
#define NVOPT_SEC0                      _NVOPT.MergedBits.grpSEC0

#define NVOPT_SEC00_MASK                1U
#define NVOPT_SEC01_MASK                2U
#define NVOPT_FNORED_MASK               64U
#define NVOPT_KEYEN_MASK                128U
#define NVOPT_SEC0_MASK                 3U
#define NVOPT_SEC0_BITNUM               0U



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 12.3.2009 8:37:32 */

#define LCDSUPPLY_BBYPASS                This_symb_has_been_depreciated
#define LCDSUPPLY_HREFSEL                This_symb_has_been_depreciated
#define LCDSUPPLY_BBYPASS_MASK           This_symb_has_been_depreciated
#define LCDSUPPLY_HREFSEL_MASK           This_symb_has_been_depreciated
#define LCDRVC                           This_symb_has_been_depreciated
#define LCDRVC_RVTRIM0                   This_symb_has_been_depreciated
#define LCDRVC_RVTRIM1                   This_symb_has_been_depreciated
#define LCDRVC_RVTRIM2                   This_symb_has_been_depreciated
#define LCDRVC_RVTRIM3                   This_symb_has_been_depreciated
#define LCDRVC_RVEN                      This_symb_has_been_depreciated
#define LCDRVC_RVTRIM                    This_symb_has_been_depreciated
#define LCDRVC_RVTRIM0_MASK              This_symb_has_been_depreciated
#define LCDRVC_RVTRIM1_MASK              This_symb_has_been_depreciated
#define LCDRVC_RVTRIM2_MASK              This_symb_has_been_depreciated
#define LCDRVC_RVTRIM3_MASK              This_symb_has_been_depreciated
#define LCDRVC_RVEN_MASK                 This_symb_has_been_depreciated
#define LCDRVC_RVTRIM_MASK               This_symb_has_been_depreciated
#define LCDRVC_RVTRIM_BITNUM             This_symb_has_been_depreciated
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
